<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest baobabPollen and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.baobabPollen</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>baobabPollen</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/baobabPollen</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>21</string>
            </array>
            <key>category</key>
            <string>21</string>
            <key>description</key>
            <string>Baobab Pollen</string>
            <key>developer</key>
            <string>21</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
echo "start baobab-pollen"
while ! /usr/local/baobab-pollen/baobab-pollen
do
  sleep 1
  echo "Restarting baobab-pollen..."
done
            </string>
            <key>unattended_install</key>
            <false/>
            <key>unattended_uninstall</key>
            <false/>
            <key>uninstall_method</key>
            <string>removepackages</string>
            <key>uninstallable</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>minimum_os_version</key>
    <string>10.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.baobabPollen</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
